grooming, updating docs
